Revit 2024 API
StructuralSettings.SymbolicCutbackForBeamAndTruss Property
 Symbolic cutback distance to be applied to all beams and trusses.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double SymbolicCutbackForBeamAndTruss { get; set; }
Visual Basic
Public Property SymbolicCutbackForBeamAndTruss As Double
	Get
	Set
Visual C++
public:
property double SymbolicCutbackForBeamAndTruss {
	double get ();
	void set (double value);
}
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace